# Filtering

In [1]:
import numpy as np
import pandas as pd
%matplotlib inline

In [2]:
df = pd.DataFrame({
    'playerID': ['bettsmo01', 'canoro01', 'cruzne02', 'ortizda01', 'cruzne02'],
    'yearID': [2016, 2016, 2016, 2016, 2017],
    'teamID': ['BOS', 'SEA', 'SEA', 'BOS', 'SEA'],
    'HR': [31, 39, 43, 38, 39]
})
df

    playerID  yearID teamID  HR
0  bettsmo01    2016    BOS  31
1   canoro01    2016    SEA  39
2   cruzne02    2016    SEA  43
3  ortizda01    2016    BOS  38
4   cruzne02    2017    SEA  39

In [4]:
cruzne02 = df['playerID'] == 'cruzne02'
cruzne02

0    False
1    False
2     True
3    False
4     True
Name: playerID, dtype: bool

In [8]:
hr_gt_40 = df['HR'] > 40
hr_gt_40

0    False
1    False
2     True
3    False
4    False
Name: HR, dtype: bool

In [9]:
notbos = df['teamID'] != 'BOS'
notbos

0    False
1     True
2     True
3    False
4     True
Name: teamID, dtype: bool

In [10]:
str_id_sw_c = df['playerID'].str.startswith('c')
str_id_sw_c

0    False
1     True
2     True
3    False
4     True
Name: playerID, dtype: bool

In [11]:
str_team_ew_S = df['teamID'].str.endswith('S')
str_team_ew_S

0     True
1    False
2    False
3     True
4    False
Name: teamID, dtype: bool

In [12]:
str_team_nc_o = ~df['playerID'].str.contains('o')
str_team_nc_o

0    False
1    False
2     True
3    False
4     True
Name: playerID, dtype: bool

In [13]:
isin_1 = df['playerID'].isin([
    'cruzne02',
    'ortizda01'
])
isin_1

0    False
1    False
2     True
3     True
4     True
Name: playerID, dtype: bool

In [14]:
isin_2 = df['yearID'].isin(range(2015, 2017 + 1))
isin_2

0    True
1    True
2    True
3    True
4    True
Name: yearID, dtype: bool

In [15]:
df2 = pd.DataFrame({
    'playerID': ['bettsmo01', 'canoro01', 'doejo01'],
    'yearID': [2016, 2016, 2017],
    'teamID': ['BOS', 'SEA', np.nan],
    'HR': [31, 39, 99]
})
df2

    playerID  yearID teamID  HR
0  bettsmo01    2016    BOS  31
1   canoro01    2016    SEA  39
2    doejo01    2017    NaN  99

In [16]:
df2['teamID'].isna()

0    False
1    False
2     True
Name: teamID, dtype: bool

In [17]:
df2['teamID'].notna()

0     True
1     True
2    False
Name: teamID, dtype: bool

In [18]:
df3 = pd.DataFrame({
    'playerID': ['bettsmo01', 'canoro01', 'cruzne02', 'ortizda01', 'bettsmo01'],
    'yearID': [2016, 2016, 2016, 2016, 2015],
    'teamID': ['BOS', 'SEA', 'SEA', 'BOS', 'BOS'],
    'HR': [31, 39, 43, 38, 18]
})
df3

    playerID  yearID teamID  HR
0  bettsmo01    2016    BOS  31
1   canoro01    2016    SEA  39
2   cruzne02    2016    SEA  43
3  ortizda01    2016    BOS  38
4  bettsmo01    2015    BOS  18

In [20]:
df[~(df['HR'] > 40)]

    playerID  yearID teamID  HR
0  bettsmo01    2016    BOS  31
1   canoro01    2016    SEA  39
3  ortizda01    2016    BOS  38
4   cruzne02    2017    SEA  39

In [21]:
df[df['teamID'].str.startswith('B')]

    playerID  yearID teamID  HR
0  bettsmo01    2016    BOS  31
3  ortizda01    2016    BOS  38